tap "manaflow-ai/cmux"

# Shell & Terminal
brew "fzf"
brew "zoxide"
brew "direnv"
brew "oh-my-posh"

# Editor
brew "neovim"

# Development
brew "mise"
brew "gh"
brew "jq"
brew "yq"
brew "git-lfs"
brew "shfmt"
brew "diffnav"

# Fonts
cask "font-fira-code-nerd-font"

# AI & Agents
cask "cmux"
brew "worktrunk"
